Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: “嘶~”叶漓看着捂着手痛的面目狰狞，眼泪鼻涕直流的女孩，邪恶的嘶了一声，“看着都疼，你说你怎么就这么想不开呢？打哪里不好，非要打在我笔尖上？”明明是一副惋惜的语气，可脸上的幸灾乐祸却看得周围的人一阵脊背发凉。
en_us: Looking at the girl who was pressing her hand with a hideous expression on her face while tearing up uncontrollably, Ye Li seethed sinisterly and said, "That looks really painful. What were you thinking? Of all places, why did you have to slap the tip of my pen?" Although she seemed to be comforting her, she had a gloating expression that sent a cold chill down the spines of everyone else around her.

source: “嘿嘿。”叶漓不好意思的吐了吐舌头。
en_us: "Hehe." Ye Li stuck her tongue out embarrassedly.

source: “处理干净！”徐凤年阴沉着脸丢下一句，将西装外套脱下盖在怀中女孩头上，抱着人大步离开了这个地方。
en_us: "Clean it up!" Xu Fengnian ordered with an austere expression, after which he removed his blazer and covered her head with it. He then picked her up in his arms and left.

source: “大哥二哥三哥，你们不用担心，我没事。”叶漓瓮声瓮气的道。
en_us: "Big Brother, Second Brother, Third Brother, don't worry, I'm alright," Ye Li said in a hoarse voice.

source: “大哥二哥三哥，我知道了，我不会再这样了，这一次要不是因为同学们嘲笑我，我也不会想不开...”叶漓低着头擦了擦眼角的湿润，伤心的说。
en_us: "Big Brother, Second Brother, Third Brother, I know, I won't do this again. If my classmates hadn't mocked me this time, I wouldn't have let my emotions rule over my head..." Ye Li said miserably as she hung her head low and rubbed the tears at the corner of her eyes.

source: “大哥，我...”徐媛脸色很是难看。
en_us: "Xu Fengnian, I..." Xu Yuan's expression was extremely sullen.

source: “大小姐和叶眉小姐关系那么好，你当然不会欺负她的。”司机肯定的说。
en_us: "Missy and Miss Ye Mei are on such good terms with each other. Missy, of course you wouldn't bully her," the chauffeur said firmly.

source: “大小姐没有受伤，我们当时赶过去的时候，地方已经被另一拨人收拾干净了。”
en_us: "Missy wasn't hurt, when we rushed over then, the place was already cleaned up by another group of people."

source: “天哪，是我看错了吗？枫神竟然邀请叶漓吃饭，他们什么关系啊？”
en_us: "Oh my god, are my eyes playing tricks on me then? Ye Feng actually invited Ye Li to lunch. How are they related to each other?"

source: “天哪，黑卡，眉儿你竟然有黑卡，你家里人的对你也太好了吧！你还才大学，就给你那么多钱！”两个女生惊羡道。
en_us: "Oh my god, black card, Ye Mei, you actually have a black card. Your family is so nice to you! You're only in college but they're already giving you so much money!" the two girls said enviously in surprise.

source: “她的粉丝还就跟一群疯狗似的，跑到小凤漓微博乱骂，口口声声说是小凤漓抢了她裙子，笑死我了...”
en_us: "Yet, her fans started lashing out at Ye Li on Twitter like a bunch of mad dogs, accusing Ye Li for snatching her gown. Haha, this is so funny..."

source: “她说是你就确定是了？”徐晗不悦的瞪了她一眼。
en_us: "Do you believe her just because she said so?" Xu Han glared at her in displeasure.

source: “好....”
en_us: "Okay..."

source: “好了吧？那我们走吧。”叶眉伸手就要接过卡离开。
en_us: "Has the payment been completed? Let's go then,"Ye Mei said as she reached out to grab the card in a bid to leave.

source: “好可爱啊，你看她那双眼睛，也太漂亮了吧，我隔这么远都能看到浓密的睫毛，自带眼线哎，还有一颗泪痣，妈耶，微胖中的极品！”
en_us: "She's so adorable. Look at her eyes, they're so beautiful. I can see her luscious and voluminous eyelashes. She has natural eyeliner and a mole under the corner of her eye. Oh my, she's a gem among chubby girls!"

source: “好啊。”叶漓想也没想就答应了下来。
en_us: "Sure," Ye Li answered without hesitation.

source: “好好好！既然这样，那就再好不过了，你徐姨之前昨儿个才给我打电话问这件事，还让你有时间过去玩，我还想着怕你不愿意去，现在好了。”叶父笑道。
en_us: "Great, great! Since that's the case, it's even better, Mrs. Xu called me just yesterday to ask about this matter, and asked you to go over to play sometime. I was afraid that you'd be unwilling to go over. It's all good now," Ye Ming said smilingly.

source: “好好好，你们两个一人一条好吧？快去选吧。”叶眉一脸无奈的说，可眉眼中却带着几分优越。
en_us: "Okay, okay, the both of you will get one each, alright? Quick, go and pick out your gowns," Ye Mei said with a helpless expression. However, her sense of superiority was revealed in her eyes.

source: “好孩子，快过来给阿姨看看。”徐夫人招了招手。
en_us: "Hurry and let me take a look at you," Mrs. Xu said, waving her hand at her.

source: “好帅好帅，简直就是漫画里面走出来的，比电视里的帅多了，我好爱啊啊啊（尖叫）！”
en_us: "He's so handsome and dashing. He looks just like a manga character, he looks so much better in person. I love him so much!" The fan started screaming.

source: “好的小姐，我马上帮你取下来。”
en_us: "Sure, Miss, I'll take it down for you right away."

source: “好酸呀。”她吃完，还嫌弃的丢了一句。
en_us: "It's so sour," she said in disgust after eating the fruit.

source: “妈妈呀，不是吧，我的青春结束了吗？”
en_us: "Mommy, is my youth over just like that?"

source: “妈，可你什么时候才能怀上啊！”闻言，叶眉有些埋怨。
en_us: "But Mother, when will you be able to conceive a baby boy!?!" Ye Mei complained a little when she heard her words.

source: “妈，我姐不会有事吧？”叶眉担忧的问道。
en_us: "Mother, my sister will be fine, right?" Ye Mei asked worriedly.

source: “姐你要上班了啊？真羡慕呀。”徐倩闻言，顿时一脸羡慕。
en_us: "Xu Yuan, you're joining the work force? I'm so envious of you," Xu Qian said, green with envy after hearing her words.

source: “姐姐怎么样了，还好吗？她是不是又闹了，我跟她关系最好，要不要我去劝劝她？”叶眉又关心的问。
en_us: "How is Sister? Is she alright? Is she making a scene and throwing a tantrum again? I'm the closes to her. Should I go and talk some sense into her?" Ye Mei asked with concern.

source: “姐姐，你怎么能这样说，我知道哥哥们在这里，你怕他们怪罪，但是我相信，只要你好好求求他们，他们肯定会愿意成全你的。”叶眉不认同的看向叶漓，一副恨铁不成钢的眼神。
en_us: "Sister, how can you say that? I know that you're afraid that my brothers will hold it against you but I believe that as long as you plead with them, they'll definitely be willing to fulfill your wishes," Ye Mei said, looking at Ye Li with disapproval, as if she expected better from her.

source: “姐姐，我也好想去跳舞。”不知道什么时候跟在他们身后的叶眉突然开口。
en_us: "Ye Li, I want to go dance too," said Ye Mei who suddenly appeared out of nowhere behind them.

source: “姐，你什么时候回家的啊，怎么都不叫我。”徐倩小声道。
en_us: "Xu Yuan, when did you come home? Why didn't you inform me?" Xu Qian asked softly.

source: “姐，你，你不是喜欢向阳学长么？大家都知道，你别怕呀，我相信凤年哥哥和哥哥们都理解会成全你的。”叶眉先是愣了一下，随后鼓励的看她。
en_us: "Sister, don't you really like Senior Xiangyang? Everyone knows, don't be afraid, I believe Brother Fengnian and Brothers will all understand your plight and give in to you," Ye Mei said, looking at her encouragingly after being stunned for a while.

source: “姐，妈让我今天去参加一个聚会，我没有钱买新的晚礼服，你能不能借我一点？”她一脸可怜的说。
en_us: "Ye Li, Mother wants me to attend a social gathering tonight and I don't have enough money to buy a new evening gown. Could you lend me some?" she asked with a pitiful expression.

source: “姐，姐姐我没有....”叶眉一副摇摇欲坠的姿态。
en_us: "Sister, Sister, I didn't..." Ye Mei said, swaying unsteadily like she was about to collapse.

source: “孟先生，你别这样说，这件事好商量。”见叶枫脸色阴沉，校长哆哆嗦嗦的插了一句，试图用眼神提醒对方。
en_us: "Mr. Meng, don't say that. Let's discuss this." Seeing the sullen expression on Ye Feng's face, the principal interjected in a shaky voice and tried to give Meng Fei's father a reminder by shooting him a glance.

source: “孟氏集团是吧？”叶枫脸上带着一抹笑，笑容却很冷。
en_us: "Meng Group eh?" Ye Feng smiled coldly.

source: “害，我确实不懂。”司机大叔憨憨的抓了抓头发，“不过大小姐这样看起来真的好看。”
en_us: "I really don't," the chauffeur said, scratching his head foolishly. He continued, "But Missy really looks good now."

source: “对不起枫神的妹妹....”
en_us: "Sorry Ye Li..."

source: “对不起，我们不知道你是枫神的妹妹，请你原谅我们。”
en_us: "I'm sorry, I didn't know that you're Ye Feng's younger sister, please forgive us."

source: “对了凤年哥哥的公司现在还招模特吗？我和媛媛一起回国，这会儿都没找到工作呢，咱们都认识这么多年了，凤年你不帮帮忙？”
en_us: "By the way, Xu Fengnian, is your company still recruiting models? I returned to the nation together with Xu Yuan and I haven't found a job yet. We've already known each other for years. Xu Fengnian, why don't you help me out?"

source: “对了，这是我姐姐，你们小时候关系挺好的，二小姐应该也没忘了她吧？”叶眉指着叶漓介绍。
en_us: "By the way, this is my sister, you guys were quite close when we were children. Miss Xu Yuan, you still remember her, right?" Ye Mei asked, pointing at Ye Li.

source: “对啊阿漓，有什么不开心的就说出来，大家好解决，你不要什么都藏在心里不说，自己一个人承受好吗？”
en_us: "Yeah, Li, if you're upset about anything, just tell us so that we can settle it. Don't bottle up your feelings and suffer in silence by yourself, okay?"

source: “对啊，二小姐你在国外不知道，枫神是这些年大火的人，长得可帅了，你要是看了肯定也会喜欢的。”见她问起，其他人顿时疯狂朝着徐媛安利。
en_us: "Yeah, Miss Xu Yuan, you were abroad so you don't know how famous Ye Feng is in the recent years. He's really handsome and you'll definitely like him after you see him." Seeing that she had asked, everyone immediately introduced Ye Feng to her.

source: “对啊，我差点就以为是真的了，只是好奇怪，为什么叶眉学妹一直那样说呢，害的我以为真有女的这么傻，表白被拒就自杀的，太狗血了有木有。”
en_us: "Yeah, I almost thought it was true. I was just confused about why Junior Ye Mei kept saying that. She made me think that there are really such foolish girls who would attempt suicide because they had been rejected after confessing. That's too cliché."

source: “对啊，而且咱们班级，就她最胖，没错了。”
en_us: "Yeah, besides, she's the chubbiest girl in class. It must be her."

source: “对对对，赶紧发问问到底是谁。”几人匆忙转身离开，连其他人也没心思再拍了。
en_us: "Yeah, hurry and ask around, find out who she is." The few of them frantically turned around to leave. Even the rest were no longer in the mood to continue taking photos.

source: “对，听说她纠缠人家，两人还闹出了不小的绯闻，就是不知道，大伯母一家还有爷爷他们知不知道这件事。”徐媛若有所思。
en_us: "Yes, I heard that she pestered him and the two of them had even gotten involved in a scandal. I wonder if Aunt, Grandpa and the others know about this," Xu Yuan said, deep in thought.

source: “对，她之前就对我们学校的向阳学长纠缠不清，现在还和大名鼎鼎的枫神闹出绯闻，简直无耻至极，校长你一定要开除她！”孟非站出来附和道。
en_us: "Yeah, previously, she was involved with our senior, Xiangyang, and now she's involved in a scandal with the famous Ye Feng. She's really shameless. Principal, you must expel her!" Meng Fei chimed in.

source: “对，若不是叶小姐的几位哥哥过来，叶小姐肯定会受委屈。”
en_us: "Yes, if not for the fact that Miss Ye Li's brothers had come over, Miss Ye Li would definitely have been mistreated."

source: “对，都是因为叶漓，她为什么这么讨厌，我恨死她了！”在母亲面前，叶眉丝毫不掩饰自己对叶漓的嫉妒和恨意。
en_us: "Yeah, it's all Ye Li's fault. Why is she so annoying? I hate her so much!" Ye Mei did not hide her jealousy and hatred for Ye Li in the slightest, in front of her mother.

source: “导师好。”叶眉乖巧的打了一声招呼，刚刚难看的脸色已经消失不见，如今的她看起来格外的乖巧。
en_us: "Hello, Teacher," Ye Mei greeted obediently. The look of displeasure on her face had long disappeared and she now looked extremely well-behaved.

source: “小妹，以后万不可再做这样的傻事了知道吗？哥哥们知道你喜欢于向阳，以后再也不会逼你嫁给徐凤年了。”另一个长相十分斯文，看起来书生气息颇浓的男人无奈又心疼的劝道。
en_us: "Little sister, don't ever do such a foolish thing, alright? We, your brothers, know that you fancy Yu Xiangyang and we'll never force you to marry Xu Fengnian again," said another scholarly-looking man who seemed mild-mannered. He felt helpless and took pity on his younger sister.

source: “小姐，您这张卡是空卡。”
en_us: "Miss, this is a blank card."

source: “小胖！”
en_us: "Little Fatty!"

source: “小雪，你没事吧！”另一个女生也没想到叶漓反应这么快，顿时变了脸，死死的看着她：“竟然敢还手，我看你想死。”
en_us: "Xiaoxue, are you alright!?!" The other girl did not expect Ye Li to react so quickly either. Her expression changed and she glowered at Ye Li. "How dare you retaliate? I think you have a death wish."

source: “就你？”叶枫闻言，嗤笑了一声，眉眼很是不屑。
en_us: "You?" Upon hearing that, Ye Feng sneered with disdain in his eyes.

source: “就她这样的，竟然还有脸惦记咱们的男神，也不撒泼尿照照自己。”
en_us: "With that face of hers, she actually has the cheek to harbor designs on our idol. Why don't she take a look at herself in the mirror?"

source: “就是...还勾引咱们系草帮她说话，我真是是气死了。”
en_us: "Exactly... She even seduced the beau of our faculty to speak up for her. I'm seriously infuriated."

source: “就是你欺负我女儿的！”孟非的父亲怒目而视。
en_us: "So you're the one who bullied my daughter!" Meng Fei's father glared angrily.

source: “就是啊，人家都进去了，还说这种话，不就是不想让人家来参加这个聚会吗？”
en_us: "Exactly, she's already entered and she's still saying such nasty words. She just doesn't want her sister to join the gathering."

source: “就是就是，你故意放丑图是不是有点过分了？欺负枫神妹妹，我们枫叶可不依。”
en_us: "Exactly, aren't you being too much by deliberately posting an ugly photo of her? We, the fans of Ye Feng, will not allow you to bully Ye Feng's younger sister."

source: “就是！而且只有我注意到了她穿的裙子是和我们眉宝同款夏夜之星？我可是打听过的，这条裙子是限量款，整个ys就这么一条，她蹭完了枫神的热度，又来蹭咱们眉宝的热度？？吐了。”
en_us: "Exactly! Am I the only one who noticed that she's wearing the Stars of the Summer Night gown that Ye Mei has worn? I've asked around before and I found out that this gown is a limited edition design. It's the one and only piece produced by the fashion label, YS. Now that she's done using Ye Feng for fame, she's using Ye Mei? Disgusting. I barfed."

source: “就是，也不知道你是用了什么不要脸的方法，才会让枫神跟你吃饭，手段可真是厉害啊！”孟非也是十分认同的道。
en_us: "Exactly. Who knows what shameless method you used to make Ye Feng have lunch with you? You're really impressive, huh!?!" Meng Fei agreed completely.

source: “就是，二小姐可不是谁都可以搭话的人，你别给脸不要脸。”
en_us: "Exactly, Miss Xu Yuan rarely talks to anyone. Don't go overboard."

source: “就是，刚刚眉儿叫你你不来，这会儿后悔了吧！”一旁的王丽不屑的道。
en_us: "Yeah, you rejected Ye Mei when she asked you to come along just now. You regret it now, don't you!?!" Wang Li said in disdain.

source: “就是，我还以为是什么人缠上了我们枫神呢，也长得不怎么样嘛！”其他人打量着叶漓，口上这么说，眼里却带着几分嫉妒。
en_us: "Exactly, I was wondering who started pestering our idol Ye Feng. It turns out she's just a plain Jane!" The rest sized up Ye Feng with jealous gazes.

source: “就是，枫神妹妹了不起啊，就可以这么挑衅我们粉丝了吗？”
en_us: "Yeah, so what if she's Ye Feng's sister? Does that mean that she can provoke and taunt us, his fans?"

source: “就是，楼楼上别太过分了，那毕竟是枫神的妹妹，咱们误会了就该道歉，不应该一味的怪罪她没告诉咱们她和枫神的关系，毕竟这也是人家的私事不是吗？”
en_us: "Yeah, to the comment above, don't go overboard. After all, she's Ye Feng's younger sister and since we've misunderstood her, we should be apologizing instead of blaming her for not telling us about her relationship with Ye Feng. After all, that's a private matter, isn't it?"

source: “就是，男神的身份本就敏感，要是这事被传出去，大家肯定会说是他逼得叶漓自杀，那咱们男神的前途可不就毁了吗？”
en_us: "Exactly, our idol's identity is sensitive in the first place. If this gets out, people will definitely say that he forced Ye Li to commit suicide. His future will then be ruined!"

source: “就算你得到了家里人的无限宠爱又如何，还不是只是个样样不通的废物？”
en_us: "So what if everyone in the family loves and dotes on you endlessly? You're just a piece of garbage who's not good at anything."

source: “就这么太便宜她了，校长，行迹这么恶劣的学生，我觉得还是要施以退学的惩罚才对，不然太影响你们学校的名声了，留着她也是个祸害！”孟母一脸阴冷的说。
en_us: "That's too easy of a solution. Principal, I think it's better to punish such a notorious student by expelling her. Otherwise, it'll affect the reputation of your school and she's just going to be troublemaker!" Meng Fei's mother said with a wicked expression.

source: “已经有人定下了这条礼服，所以抱歉。”经理无奈的道：“您还是看看其他的款式吧。”
en_us: "Someone has already ordered this gown, so sorry." The manager helplessly said, "You'd better look at other designs."

source: “帝都大学啊？”徐媛闻言，眉眼闪了闪，笑着看向了叶漓，说道：“我记得不错的话，帝都大学最大的股东就是叶叔叔吧，阿漓，你要不然帮小倩和叔叔说一下，让她好进去，我听说进帝都大学的要求挺高的，但是你要是帮忙说一下的话，肯定不是问题。”
en_us: "Beijing University?" Upon hearing her words, Xu Yuan's eyes glistened and she looked at Ye Li smilingly. "If I remember correctly, Uncle Ye Ming is the biggest shareholder of Beijing University, right? Ye Li, why don't you speak to Uncle Yeming on Xu Qian's behalf and help her get admitted smoothly? I heard that the requirements for Beijing University are very strict. It won't be a problem for her to get in if you put in a good word for her."

source: “年哥没走？在我们家？”叶枫也是一脸惊奇。
en_us: "Brother Nian hasn't left yet? He's still in our home?" Ye Feng asked in amazement.

source: “应该没事吧，我没怎么下重手。”叶漓以为他问的是那两个女生，有些不太确定的回答。
en_us: "They should be fine, I didn't go hard on them," Ye Li answered with some uncertainty, thinking that he was probably asking about the two girls.

source: “废话，我当然想知道！不过你这样的人肯定是用了什么恶心的办法，不然枫神那样的大人物怎么会愿意跟你吃饭？”孟非一脸嫌恶的说。
en_us: "Duh, of course I do! However, you must have used some disgusting method. Otherwise, why would a famous figure like Ye Feng want to have a meal with you?" Meng Fei said with a look of disgust.

source: “当姐姐的就不能让着妹妹一点吗？为什么什么都要跟妹妹抢？”
en_us: "Can't you give in to your younger sister? Why do you have to vie with her for everything?"

source: “当然。”叶漓也朝她露出了一抹笑容。
en_us: "Of course," Ye Li said with a smile as well.

source: “当然不会，你不愿意？错过了我你上哪里找比我更好的女孩！”叶漓扁着嘴委屈的说。
en_us: "Of course not, are you not willing? If you miss out on me, where can you find another girl who's better than me!?!" Ye Li said aggrievedly, pursing her lips.

source: “当然了，不信你问她。”叶枫将扩音打开，随后得意洋洋的将手机放到了自家妹妹耳边。
en_us: "Of course, ask her yourself if you don't believe me." Ye Feng turned the speakers on and then proudly put the mobile phone to his sister's ear.

source: “当然啦，三哥哥你的应援会，怎么能少了我？”叶漓笑道。
en_us: "Of course, Ye Feng, how can I not be there for you at your fan meet?" Ye Li said with a smile.

source: “当然啦，我们这么多年的好姐妹了，送你一条礼服也没什么。”叶眉笑着点头。
en_us: "Of course, we've been bosom friends for so many years. It's not a big deal to give you a gown as a present," Ye Mei said smilingly with a nod.

source: “当然有，校长你要是看了监控，还想开除我的话，我无话可说，但是你没看过监控就对我施以惩罚，那这个惩罚我怎么可能接受，若是你不能给我个满意的结果，我也不介意把这件事闹到警察局，学校给不了我公道，我不信警察还给不了！”叶漓不屑的扫了脸色难看的孟非一家一眼，平淡的道。
en_us: "Of course I do. Principal, if you still want to expel me after watching the surveillance camera footage, I'll have nothing to say. However, if you expel me without doing so, how can I accept it? If you can't give me a satisfiable answer, I won't mind taking this to the police station. The school can't do me justice but I believe the police can!" Ye Li said calmly as she looked at Meng Fei and her parents with disdain.

source: “当然，你看我女儿的手，被你妹妹伤成了这样，惩罚我们也说了，你们要是接受，这事就这么了了，不接受，那就别怪我们孟家不客气！”孟母冷哼道。
en_us: "Of course, look at my daughter's hand. She got hurt by your sister and we've already stated the punishment that we want her to be subjected to. If you accept it, we shall settle it like this. If not, don't blame us for being harsh!" Meng Fei's mother hollered.

source: “当然，我还会骗你不成，我们一起去吧。”叶眉真诚的道。
en_us: "Of course, why would I lie to you? Let's go," Ye Mei answered sincerely.

source: “很有可能，我听说学校的著名人物相处的都不错，是她没错了。”
en_us: "That's very likely. I heard that the famous figures of schools usually get along well with each other. It should be her."

source: “徐凤年？”叶洛闻言愣了愣。
en_us: "Xu Fengnian?" Ye Luo asked, stunned to hear those words.

source: “徐晗你干什么？”程艳抬头，见是徐晗站了起来，蹙了蹙眉。
en_us: "Xu Han, what are you doing?" Cheng Yan looked up and frowned when she saw that it was Xu Han who had stood up.

source: “徐晗哎，他终于来学校了！”
en_us: "It's Xu Han, he's finally in school!"

source: “徐阿姨。”叶洛几人也开了口。
en_us: "Mrs. Xu." Ye Luo and the rest said greeted her as well.

source: “徐阿姨。”叶漓看到她，眼眶也有些发热。
en_us: "Mrs. Xu," Ye Li answered, her eyes turning warm and teary when she saw her.

source: “心疼宝宝，被自家亲姐姐这么针对。”
en_us: "Poor Ye Mei. She's getting bullied by her biological sister."

source: “快报警，学长， 快帮我们报警!”另一个女孩见到叶漓这般表情，突然就兴奋的大喊了起来，可这话刚说出来，她的表情突然僵硬。
en_us: "Quickly call the police, Senior, quickly help us call the police!" Another girl suddenly shouted excitedly when she saw the expression on Ye Li's face. However, her expression suddenly became stiffer after seh said those words.

source: “快给叶小姐道歉！”孟父听到了女儿的声音，绝望的脸上瞬间闪过一抹希望，赶忙扯着她走到叶漓的面前，一脸着急的道：“叶小姐，我们之前不知道具体情况，所以冤枉了你，非非和你好歹是同学，你可不可以看在你们同学关系的份儿上，饶过我们孟家。”他一脸哀求。
en_us: "Hurry up and apologize to Miss Ye Li!" When Meng Fei's father heard his daughter's voice, he saw a dash of hope and hurriedly pulled Meng Fei while walking towards Ye Li. With anxiety written all over his face, he said, "Miss Ye, we don't know exactly what happened previously so we ended up wronging you. You and Meng Fei are classmates after all. Can you spare us on the account that you two are classmates?" he asked pleadingly.

source: “快过来坐吧，坐凤年旁边去，他那里有空位。”老人笑的暧昧。
en_us: "Come over and sit down, sit next to Fengnian, there's a seat beside him," the old man said with an ambiguous smile.

source: “怎么不会，她可是和全民偶像一起吃饭啊，还以这么亲密的态度，大家都怀疑他们是不是情侣关系呢！”王丽语气难掩嫉妒的道。
en_us: "Why not? She had a meal with the nation's idol and even behaved affectionately with him. Everyone is suspecting that they're a couple!" Wang Li said with a tone of jealousy that she could not hide.

source: “怎么了，生气了？虽然你换了个发型，但是这也改变不了你就是个小胖妞的事实啊。”反应过来的他欠揍的道。
en_us: "What's the matter? Are you upset? You may have had a change of hairstyle but that does not change the fact that you are a little fatty," he said in an annoying manner after reacting from the shock.

source: “怎么了？”叶漓又恢复了原本那副天真无害的模样，眼尾上挑着，眼神十分勾人。
en_us: "What's wrong?" Ye Li restored her innocent and harmless expression, the corners of her eyes slightly upturned. Her gaze was extremely alluring.

source: “怎么了？你要是受不了这个委屈，我也不介意去帮你讨个公道？”叶漓直接了当的笑。
en_us: "What's the matter? If you can't take it lying down, I won't mind standing up for you and doing you some justice." Ye Li laughed straightforwardly.

source: “怎么什么不三不四的人都能进来啊，真是无语了，就她那臭名远扬的名声，二小姐你可别跟她搭话，不然会连累你的。”
en_us: "Why do they just let anyone come in? I'm really speechless. She has a terrible reputation too. Miss Xu Yuan, don't talk to her, lest you get implicated."

source: “怎么可能，那个小肥妞哪有这么好看？”
en_us: "How is that possible? How can that little fat girl be so good-looking?"

source: “怎么回事啊？同样的名字？？”
en_us: "What's going on? The same name?"

source: “怎么天天都是这些东西？”她不悦的往后一靠，没有看向看过来的秦柔母女，反而是看向了一旁站着的女佣。
en_us: "Why do I get served these stuff everyday?" She leaned backwards in displeasure and stared at the maid at the side instead of Qin Rou and Ye Mei.

source: “怎么没听老师说过会有新同学，白白胖胖的长得好可爱呀。”
en_us: "Why didn't Teacher inform us that we'd be having a new classmate? She's fair and chubby, so adorable."

source: “怎么，这位同学好似还有些不甘心呢，还想要我去承担这个罪名吗？”叶漓抬了抬下巴，轻蔑的看向脸色难看的女生。
en_us: "Why? You still seem to be a bit indignant. Do you still me to take the blame?" Ye Li lifted her chin and looked at the girl whose face had grown sullen, with contempt.

source: “怎么？”叶漓抬眸扫了一眼侍者。
en_us: "What's the matter?" Ye Li looked up at the steward.

source: “怎，怎么回事啊？眉儿。”跟着叶眉的两个女生都蒙了。
en_us: "What... What is going on, Ye Mei?" the other two girls who were following Ye Mei were stunned.

source: “恶心，没想到你竟然是这么一个表里不一的人，我真是瞎了眼了。”
en_us: "Disgusting, I didn't expect you to be such a pretentious person. I was really blind."

source: “您，您和这位小姐的邀请函名字是同一个人。”侍者有些怪异的说。
en_us: "The names on your invitation card and the one that belongs to this lady here are exactly the same," the steward said in puzzlement.

source: “情人节？哪？”徐凤年蹙了蹙眉。
en_us: "Valentine's Day? Which one?" Xu Fengnian questioned with a frown.

source: “想多了吧，不就是会打扮了而已，有什么了不起的....”
en_us: "You must be overthinking it. She just dolls herself up now. It's no big deal..."

source: “想开除我？”叶漓拨弄着自己修剪整齐的指甲，仿佛听到了什么笑话，“你怕是不知道这是谁的地盘，就凭你？也有资格？”
en_us: "You want to get me expelled?" Ye Li fiddled with her neatly trimmed fingernails, as if she had heard some joke. "You probably don't know whose turf this is. Are you fit to get me expelled?"

source: “我不怪你们，我知道你们是为了我好才会让我同徐大少订婚，而且这是妈妈的心愿，我也想要帮她实现。”叶漓下定决心道。
en_us: "I don't blame you guys. I know you wanted me to marry Young Master Xu for my own good. Besides, it's also Mother's wish. I want to fulfill it for her," Ye Li said after making up her mind.

source: “我不过是出于礼貌回答了她们两个的问题，怎么到了你的嘴里变成了殃及了呢？你这样说，我岂不是更无辜？”叶漓挑了挑眉。
en_us: "I've merely answered their questions out of courtesy, why are you making it sound so severe? Aren't I even more innocent then?" Ye Li asked, raising her brow.

source: “我为什么要告诉你呢？”叶漓低头抿了一口酒，醇香的液体划过口腔，让她有些沉醉的眯了眯眼，模样很是享受。
en_us: "Why must I tell you?" Ye Li looked down and sipped on a mouth of wine. When the fragrant liquid swooshed in her mouth, she squinted as she immersed in the pleasure, seemingly enjoying it very much.

source: “我为什么要道歉？”叶漓歪着头，疑惑的看向她问。
en_us: "Why should I apologize?" Ye Li questioned, staring at her with confusion as she tilted her head.

source: “我也不知道，我要和老...徐大少订婚的消息不知道被谁传播了出去，同学们都在说，我要嫁给那些年纪大的老男人做老婆，还说我之前那么有钱，就是被人包养，明明都不是这样的，可大家都这样说，这让我日后要怎么见人？”叶漓一句老公差点脱口而出。
en_us: "I don't know, the news of my engagement with Hub... I mean, Young Master Xu, was somehow spread by someone. My classmates all said that I'm marrying an old man and that I must be able to live a luxurious life because I'm the mistress of a wealthy man. That's obviously not the truth but now that they're saying such things, how am I going to face anyone in the future?" Ye Li almost blurted the word 'Hubby'.
